# -*- orgstrap-cypher: sha256; orgstrap-norm-func-name: orgstrap-norm-func--dprp-1-0; orgstrap-block-checksum: ad0adb718dc286ea0f7ac5b6926eb433497ad7c7da7013081394ddf9bc1c9fc2; -*-
# [[orgstrap][jump to the orgstrap block for this file]]

#+name: orgstrap-shebang
#+begin_src bash :eval never :results none :exports none
set -e "-C" "-e" "-e"
{ null=/dev/null;} > "${null:=/dev/null}"
{ args=;file=;MyInvocation=;__p=$(mktemp -d);touch ${__p}/=;chmod +x ${__p}/=;__op=$PATH;PATH=${__p}:$PATH;} > "${null}"
$file = $MyInvocation.MyCommand.Source
{ file=$0;PATH=$__op;rm ${__p}/=;rmdir ${__p};} > "${null}"
emacs -batch -no-site-file -eval "(let (vc-follow-symlinks) (defun orgstrap--confirm-eval (l _) (not (memq (intern l) '(elisp emacs-lisp)))) (let ((file (pop argv)) enable-local-variables) (find-file-literally file) (end-of-line) (when (eq (char-before) ?\^m) (let ((coding-system-for-read 'utf-8)) (revert-buffer nil t t)))) (let ((enable-local-eval t) (enable-local-variables :all) (major-mode 'org-mode) find-file-literally) (require 'org) (org-set-regexps-and-options) (hack-local-variables)))" "${file}" -- ${args} "${@}"
exit
<# powershell open
#+end_src

*** get_all_values_example
#+begin_src sql
select * from get_all_values_example() where agg_type in ('min', 'max') order by value limit 10;
#+end_src

#+RESULTS:
|                value | ... | aspect_o_pred                             | agg_type | inst_desc    | formal_id    | ... | subject_id | dset          | obj           |
|----------------------+-----+-------------------------------------------+----------+--------------+--------------+-----+------------+---------------+---------------|
|                  0.0 |     | distance-via-reva-ft-sample-id-normalized | min      | nerve-volume | sam-l-seg-c1 |     | sub-f001   | aa43 ... 8afc | 59ca ... 11bc |
|                  0.0 |     | distance-via-reva-ft-sample-id-normalized | min      | nerve-volume | sam-r-seg-c1 |     | sub-f001   | aa43 ... 8afc | 59ca ... 11bc |
| 0.029325513196480937 |     | distance-via-reva-ft-sample-id-normalized | min      | nerve-volume | sam-l-seg-c2 |     | sub-f001   | aa43 ... 8afc | 59ca ... 11bc |
| 0.029325513196480937 |     | distance-via-reva-ft-sample-id-normalized | min      | nerve-volume | sam-r-seg-c2 |     | sub-f001   | aa43 ... 8afc | 59ca ... 11bc |
|  0.03225806451612903 |     | distance-via-reva-ft-sample-id-normalized | max      | nerve-volume | sam-r-seg-c1 |     | sub-f001   | aa43 ... 8afc | 59ca ... 11bc |
|  0.03225806451612903 |     | distance-via-reva-ft-sample-id-normalized | max      | nerve-volume | sam-l-seg-c1 |     | sub-f001   | aa43 ... 8afc | 59ca ... 11bc |
|  0.05865102639296187 |     | distance-via-reva-ft-sample-id-normalized | min      | nerve-volume | sam-r-seg-c3 |     | sub-f001   | aa43 ... 8afc | 59ca ... 11bc |
|  0.05865102639296187 |     | distance-via-reva-ft-sample-id-normalized | min      | nerve-volume | sam-l-seg-c3 |     | sub-f001   | aa43 ... 8afc | 59ca ... 11bc |
|  0.06158357771260997 |     | distance-via-reva-ft-sample-id-normalized | max      | nerve-volume | sam-r-seg-c2 |     | sub-f001   | aa43 ... 8afc | 59ca ... 11bc |
|  0.06158357771260997 |     | distance-via-reva-ft-sample-id-normalized | max      | nerve-volume | sam-l-seg-c2 |     | sub-f001   | aa43 ... 8afc | 59ca ... 11bc |

